{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence describing logo integration and header layout updates tied to CalculatorPage.tsx.",
  "frontend-file-summaries.txt": "Text file listing brief summaries for major frontend source files.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme tokens using OKLCH variables.",
  "frontend/index.html": "HTML entry point with PWA meta tags and root mounting container.",
  "frontend/public/manifest.webmanifest": "Web manifest enabling PWA installation with icons and standalone display mode.",
  "frontend/src/App.tsx": "Root React component rendering the CalculatorPage inside a full-height layout.",
  "frontend/src/features/calculator/CalculatorDisplay.tsx": "Display component showing the current expression, result, or error with styled layout.",
  "frontend/src/features/calculator/CalculatorKeypad.tsx": "Scientific keypad component rendering an 8x4 grid of buttons with variant styling and click handling.",
  "frontend/src/features/calculator/CalculatorPage.tsx": "Main calculator page combining header, display, keypad, history toggle, steps panel, and footer.",
  "frontend/src/features/calculator/useCalculator.ts": "Hook managing calculator state, input handling, parsing, evaluation, and step generation.",
  "frontend/src/features/history/HistoryPanel.tsx": "Scrollable panel showing stored calculation history with clear functionality.",
  "frontend/src/features/history/useLocalHistory.ts": "Hook managing persistent history through localStorage with load, add, and clear logic.",
  "frontend/src/features/steps/StepsPanel.tsx": "Accordion panel displaying numbered step-by-step solution explanations.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and managing an authenticated or anonymous backend actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Stub hook that returns an empty object because the app requires no backend queries.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark theme variables and utility classes for layout and safe-area support.",
  "frontend/src/lib/calc/evaluate.ts": "Evaluates an AST of mathematical expressions, supporting constants, operators, unary ops, and functions with error handling.",
  "frontend/src/lib/calc/math.ts": "Implements factorial with input validation and safeguards against invalid or excessively large values.",
  "frontend/src/lib/calc/parse.ts": "Parses tokens into an AST using precedence rules for operators, functions, parentheses, and unary/postfix operators.",
  "frontend/src/lib/calc/stepSolver.ts": "Generates human-readable evaluation steps from an expression, including token summary, AST description, and step-by-step evaluation.",
  "frontend/src/lib/calc/tokenize.ts": "Tokenizes a math expression, normalizing symbols and producing tokens for numbers, operators, functions, constants, and parentheses.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors, animations, and plugins.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, known issues, and existing feature requirements for building a mobile-friendly IC-based scientific calculator app with local history and a rule-based solver."
}