{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping premium UI, unlock flow, and gated steps to involved frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS theme setup defining color variables and light/dark UI styling.",
  "frontend/index.html": "HTML entry file loading the main app and PWA metadata.",
  "frontend/public/manifest.webmanifest": "Web manifest enabling PWA install with icons and app metadata.",
  "frontend/src/App.tsx": "Root component rendering the CalculatorPage inside a full‑height layout.",
  "frontend/src/features/calculator/CalculatorDisplay.tsx": "Displays the current expression, result, or errors with styled layout.",
  "frontend/src/features/calculator/CalculatorKeypad.tsx": "Renders the scientific keypad and emits button events to the calculator logic.",
  "frontend/src/features/calculator/CalculatorPage.tsx": "Main calculator screen integrating display, keypad, history, steps, and premium section with view switching.",
  "frontend/src/features/calculator/PremiumSection.tsx": "UI block providing UPI payment buttons, confirmation flow, and premium status display.",
  "frontend/src/features/calculator/useCalculator.ts": "Hook handling expression editing, parsing, evaluation, error handling, and step generation.",
  "frontend/src/features/history/HistoryPanel.tsx": "History view showing past calculations with scrolling and a clear‑history control.",
  "frontend/src/features/history/useLocalHistory.ts": "Manages calculator history in localStorage with functions to add and clear entries.",
  "frontend/src/features/premium/usePremium.ts": "Tracks and persists premium status in localStorage with methods to unlock or reset it.",
  "frontend/src/features/steps/StepsPanel.tsx": "Displays step-by-step solution UI, limiting visible steps for non-premium users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty query set since no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/calc/evaluate.ts": "Evaluates an AST to a numeric result, supporting operators, functions, constants, and error handling.",
  "frontend/src/lib/calc/math.ts": "Implements factorial with validation and size limits.",
  "frontend/src/lib/calc/parse.ts": "Parses tokens into an AST supporting operator precedence, functions, constants, and errors.",
  "frontend/src/lib/calc/stepSolver.ts": "Generates human-readable evaluation steps from an expression, including tokens, AST, and evaluation order.",
  "frontend/src/lib/calc/tokenize.ts": "Converts an expression string into tokens, handling numbers, functions, operators, constants, and normalization.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color tokens, extended theme settings, and several plugins.",
  "project_state.json": "Defines the project's state, goals, architecture notes, issues, and implemented feature metadata for the IC calculator app."
}