{
  "backend/main.mo": "Empty Motoko actor providing no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping app features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text JSON containing prewritten summaries of frontend files for reference.",
  "frontend/index.css": "Tailwind base file defining light and dark OKLCH theme variables and global styles.",
  "frontend/index.html": "Main HTML entry with PWA meta tags and script loader for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, and standalone display mode.",
  "frontend/src/App.tsx": "Root React component rendering the calculator page in a full-height layout.",
  "frontend/src/features/calculator/CalculatorDisplay.tsx": "Renders the calculator expression input and result/error area using styled components.",
  "frontend/src/features/calculator/CalculatorKeypad.tsx": "Scientific keypad grid with buttons that emit click events and themed variants.",
  "frontend/src/features/calculator/CalculatorPage.tsx": "Main calculator page wiring display, keypad, history, and steps panels with UI layout.",
  "frontend/src/features/calculator/useCalculator.ts": "Hook managing calculator state, building tokens/AST, evaluating expressions, and returning results and steps.",
  "frontend/src/features/history/HistoryPanel.tsx": "Scrollable UI panel showing saved calculation history with a clear button.",
  "frontend/src/features/history/useLocalHistory.ts": "Hook storing calculation history in localStorage and providing load, add, and clear functions.",
  "frontend/src/features/steps/StepsPanel.tsx": "Accordion panel that displays generated step-by-step solution text.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity authentication, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Stub hook that returns no queries since the app performs all logic locally.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for light and dark modes with OKLCH color tokens.",
  "frontend/src/lib/calc/evaluate.ts": "Evaluates an AST representing a mathematical expression, supporting operators, constants, functions, and error handling.",
  "frontend/src/lib/calc/math.ts": "Implements factorial with bounds and validation for integer, non-negative inputs.",
  "frontend/src/lib/calc/parse.ts": "Parses a token list into an AST using recursive descent, handling precedence, unary operators, functions, and errors.",
  "frontend/src/lib/calc/stepSolver.ts": "Generates human-readable step-by-step explanations of tokenization, AST structure, evaluation order, and the final result.",
  "frontend/src/lib/calc/tokenize.ts": "Converts a math expression string into tokens, handling numbers, functions, constants, operators, and normalization of symbols.",
  "frontend/src/main.tsx": "Initializes the React app, setting up query client and Internet Identity provider before rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, OKLCH-based theme extensions, plugins, and container settings.",
  "project_state.json": "Defines the project’s state, goals, architectural notes, and a list of required features for a mobile-friendly scientific calculator web app with local history and a rule-based solver."
}