{
  "kind": "build_request",
  "title": "Add UPI payment/donation section below Steps Panel and implement premium unlock for step solver",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a new “Premium” section in the calculator UI that renders directly below the Step-by-Step Solution panel (and only on the Calculator view, not the History view). This section must include two buttons with the exact UPI deep links provided: (1) “Unlock Premium AI Step Solver (₹50)” opening `upi://pay?pa=soumya83918@ptyes&pn=Soumyajit Dutta&tn=AI Premium Feature&am=50&cu=INR` and (2) “Donate via UPI” opening `upi://pay?pa=soumya83918@ptyes&pn=Soumyajit Dutta&tn=Donation&cu=INR`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Placement: “I want the UPI buttons to appear below the AI Step Solver in the calculator UI.”"
        ]
      },
      "acceptanceCriteria": [
        "When Step-by-Step Solution is visible (steps exist), a Premium section appears immediately below it in the Calculator view.",
        "The “Unlock Premium AI Step Solver (₹50)” button opens the exact UPI URL `upi://pay?pa=soumya83918@ptyes&pn=Soumyajit Dutta&tn=AI Premium Feature&am=50&cu=INR` in a new tab/window.",
        "The “Donate via UPI” button opens the exact UPI URL `upi://pay?pa=soumya83918@ptyes&pn=Soumyajit Dutta&tn=Donation&cu=INR` in a new tab/window.",
        "The Premium section styling matches the existing premium light theme (bg-card/border-border/rounded/shadow-sm conventions) and is mobile-friendly."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Implement an in-app premium unlock state that is triggered by the UPI unlock flow and persists locally in the browser (no backend verification). After the user initiates the unlock payment, the UI must provide a clear in-app confirmation action to mark premium as unlocked (do not rely only on an alert).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Unlock behavior: “After payment, the app should actually unlock the premium AI step solver—not just show a thank‑you alert.”"
        ]
      },
      "acceptanceCriteria": [
        "Premium unlock state persists across page reloads using browser-only storage (e.g., localStorage).",
        "After initiating the UPI unlock payment flow, the app presents a user-driven confirmation to complete the unlock (e.g., “I have paid, unlock premium”).",
        "Once premium is unlocked, the UI clearly indicates premium status (e.g., label/badge/text) and the unlock button is replaced/disabled to prevent repeated unlock prompts in normal use.",
        "No backend canister calls are introduced for payment verification or state storage."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Gate the Step-by-Step Solution experience based on premium status: when premium is NOT unlocked, the Steps panel must show a limited/basic step view and a visible prompt indicating that premium unlock reveals the full/detailed step solver; when premium IS unlocked, the Steps panel must show the full detailed step list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "After payment, the app should actually unlock the premium AI step solver"
        ]
      },
      "acceptanceCriteria": [
        "With premium locked, the Steps panel displays only a subset of steps (basic view) and an explicit message in English indicating that premium unlock reveals the full/detailed steps.",
        "With premium unlocked, the Steps panel displays the complete generated steps list.",
        "Toggling premium state (via the confirmation flow) updates the Steps panel immediately without requiring a reload.",
        "Existing step generation remains local/rule-based and does not call any external AI APIs."
      ]
    }
  ],
  "constraints": [
    "Do not attempt to programmatically verify UPI payment completion; unlocking is a local UI state only.",
    "Do not add external AI APIs or any network-based AI integrations.",
    "Do not modify any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor; do not introduce backend persistence for premium/unlock or history."
  ],
  "nonGoals": [
    "Implementing secure payment verification or server-side receipt validation for UPI payments.",
    "Adding any third-party authentication beyond the existing Internet Identity setup.",
    "Changing calculator math/evaluation behavior beyond what is necessary to support premium-gated step display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}