{
  "kind": "build_request",
  "title": "Add uploaded logo to header alongside “Soumyajit Dutta”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add the user-uploaded logo image (file_00000000b77c72089c9effad0d4cec39.png) to the app’s static assets and render it in the calculator header alongside the existing “Soumyajit Dutta” text (do not replace the name), keeping the current premium white/light theme intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to add a logo",
          "The logo should appear in the header at the top of the app, above or next to my name.",
          "It should sit alongside “Soumyajit Dutta”, not replace it.",
          "Keep the premium white/light theme intact.",
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "The uploaded image file is included in the frontend as a static asset and is referenced by the header UI.",
        "The header continues to display “Soumyajit Dutta” exactly as text, with the logo placed next to it (or above it) within the header area.",
        "Logo sizing is visually balanced with the header (not stretched), maintains aspect ratio, and does not cause layout overflow on small mobile screens.",
        "The logo has an appropriate alt text for accessibility (in English).",
        "Existing header elements (title, History/Calculator toggle) remain functional and visually consistent with the current premium light theme."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the header layout implementation in frontend/src/features/calculator/CalculatorPage.tsx to accommodate the added logo while preserving current spacing, typography, and overall header hierarchy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The logo should appear in the header at the top of the app, above or next to my name.",
          "It should sit alongside “Soumyajit Dutta”, not replace it."
        ]
      },
      "acceptanceCriteria": [
        "CalculatorPage header renders the logo and name together as a single cohesive identity block.",
        "No regressions: the header still renders correctly in both Calculator view and History view, and the toggle still switches panels."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not remove or replace the “Soumyajit Dutta” text; the logo must be additional.",
    "Preserve the existing premium white/light theme (no restyling or theme overhaul).",
    "Frontend immutable paths must not be edited (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend remains single-actor; do not add backend dependencies for the logo."
  ],
  "nonGoals": [
    "Do not add third-party image/CDN hosting for the logo.",
    "Do not change PWA manifest icons unless explicitly requested.",
    "Do not implement new calculator features unrelated to the header logo."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}