{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add static logo image to calculator header alongside “Soumyajit Dutta”",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Add the uploaded logo as a static frontend asset and render it in the calculator header alongside the existing “Soumyajit Dutta” text while preserving the premium light theme.",
      "acceptanceCriteria": [
        "The uploaded image file is included in the frontend as a static asset and is referenced by the header UI.",
        "The header continues to display “Soumyajit Dutta” exactly as text, with the logo placed next to it (or above it) within the header area.",
        "Logo sizing is visually balanced with the header (not stretched), maintains aspect ratio, and does not cause layout overflow on small mobile screens.",
        "The logo has an appropriate alt text for accessibility (in English).",
        "Existing header elements (title, History/Calculator toggle) remain functional and visually consistent with the current premium light theme."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/file_00000000b77c72089c9effad0d4cec39.png",
          "operation": "create",
          "description": "Add the provided uploaded logo image to the app’s public static assets so it can be referenced by the header UI."
        },
        {
          "path": "frontend/src/features/calculator/CalculatorPage.tsx",
          "operation": "modify",
          "description": "Reference the static logo image from the header and render it alongside the existing “Soumyajit Dutta” text (do not replace the name). Constrain size (e.g., fixed height with object-contain, no stretching), include an English alt text, and ensure the layout remains responsive without overflow on small screens while keeping existing header behavior and premium light styling intact."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Adjust the CalculatorPage header layout to accommodate the logo while preserving spacing, typography, and header hierarchy across Calculator and History views.",
      "acceptanceCriteria": [
        "CalculatorPage header renders the logo and name together as a single cohesive identity block.",
        "No regressions: the header still renders correctly in both Calculator view and History view, and the toggle still switches panels."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/calculator/CalculatorPage.tsx",
          "operation": "modify",
          "description": "Update the header structure/classes to group the logo + “Soumyajit Dutta” as a cohesive identity block within the existing header, preserving spacing/typography and ensuring the History/Calculator toggle remains aligned and fully functional in both views."
        }
      ]
    }
  ]
}